---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.HighestAssociatedLevel
source: html/039aa957-53cc-cd16-deea-8cb7d677c23a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.HighestAssociatedLevel Property

"Highest Associated Level": The highest level associated with this Analytical Element.

## Syntax (C#)
```csharp
public static ForgeTypeId HighestAssociatedLevel { get; }
```